package br.com.sistemaPlanoSaude.main;

import java.util.ArrayList;
import java.util.List;
import java.util.Scanner;

import br.com.sistemaPlanoSaude.model.funcionarios.Medico;
import br.com.sistemaPlanoSaude.model.pessoas.Paciente;
import br.com.sistemaPlanoSaude.model.planos.PlanoBasico;
import br.com.sistemaPlanoSaude.model.planos.PlanoPremium;
import br.com.sistemaPlanoSaude.view.interfaces.interfaceInterresado;
import br.com.sistemaPlanoSaude.view.formularios.FormularioMedico;
import br.com.sistemaPlanoSaude.view.formularios.FormularioPaciente;
import br.com.sistemaPlanoSaude.view.interfaces.InterfaceConsulta;

public class Main {

    // =============================================================
    //      Cores para melhorar a interface do sistema
    // =============================================================

	public static final String RESET = "\u001B[0m";
	public static final String BLACK = "\u001B[30m";
	public static final String RED = "\u001B[31m";
	public static final String GREEN = "\u001B[32m";
	public static final String YELLOW = "\u001B[33m";
	public static final String BLUE = "\u001B[34m";
	public static final String PURPLE = "\u001B[35m";
	public static final String CYAN = "\u001B[36m";
	public static final String WHITE = "\u001B[37m";

	public static void main(String[] args) throws InterruptedException {
		Scanner scanner = new Scanner(System.in);
		List<Paciente> pacientes = new ArrayList<>();

System.out.println(
"""

───────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────
─██████──██████─██████████████─██████████████─██████─────────██████████████─██████──██████─██████████████─██████████████─████████████████───██████████████─
─██░░██──██░░██─██░░░░░░░░░░██─██░░░░░░░░░░██─██░░██─────────██░░░░░░░░░░██─██░░██──██░░██─██░░░░░░░░░░██─██░░░░░░░░░░██─██░░░░░░░░░░░░██───██░░░░░░░░░░██─
─██░░██──██░░██─██░░██████████─██░░██████░░██─██░░██─────────██████░░██████─██░░██──██░░██─██░░██████████─██░░██████░░██─██░░████████░░██───██░░██████████─
─██░░██──██░░██─██░░██─────────██░░██──██░░██─██░░██─────────────██░░██─────██░░██──██░░██─██░░██─────────██░░██──██░░██─██░░██────██░░██───██░░██─────────
─██░░██████░░██─██░░██████████─██░░██████░░██─██░░██─────────────██░░██─────██░░██████░░██─██░░██─────────██░░██████░░██─██░░████████░░██───██░░██████████─
─██░░░░░░░░░░██─██░░░░░░░░░░██─██░░░░░░░░░░██─██░░██─────────────██░░██─────██░░░░░░░░░░██─██░░██─────────██░░░░░░░░░░██─██░░░░░░░░░░░░██───██░░░░░░░░░░██─
─██░░██████░░██─██░░██████████─██░░██████░░██─██░░██─────────────██░░██─────██░░██████░░██─██░░██─────────██░░██████░░██─██░░██████░░████───██░░██████████─
─██░░██──██░░██─██░░██─────────██░░██──██░░██─██░░██─────────────██░░██─────██░░██──██░░██─██░░██─────────██░░██──██░░██─██░░██──██░░██─────██░░██─────────
─██░░██──██░░██─██░░██████████─██░░██──██░░██─██░░██████████─────██░░██─────██░░██──██░░██─██░░██████████─██░░██──██░░██─██░░██──██░░██████─██░░██████████─
─██░░██──██░░██─██░░░░░░░░░░██─██░░██──██░░██─██░░░░░░░░░░██─────██░░██─────██░░██──██░░██─██░░░░░░░░░░██─██░░██──██░░██─██░░██──██░░░░░░██─██░░░░░░░░░░██─
─██████──██████─██████████████─██████──██████─██████████████─────██████─────██████──██████─██████████████─██████──██████─██████──██████████─██████████████─
───────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────
"""
);

		int maxGrupos = 10;

        System.out.println("\nCarregando programa:");

		for (int i = 1; i <= maxGrupos; i++) {
			printBarra(i, maxGrupos);
            Thread.sleep(300);
        }
		
		System.out.println("\n" + GREEN +
"╔════════════════════════════════════════════╗\n" +
"║   SISTEMA DE GERENCIAMENTO DE SAÚDE        ║\n" +
"╚════════════════════════════════════════════╝" + RESET);

boolean loopMenu = true;

while (loopMenu) {

    System.out.println(BLUE +
    "\n╔════════════════════════════════════════════╗" +
    "\n║                MENU PRINCIPAL              ║" +
    "\n╠════════════════════════════════════════════╣" + RESET);

    System.out.println(CYAN + "║  [1] 🧑 Cadastrar paciente                  ║" + RESET);
    System.out.println(CYAN + "║  [2] 📋 Criar paciente exemplo              ║" + RESET);
    System.out.println(CYAN + "║  [3] 📄 Listar pacientes                    ║" + RESET);
    System.out.println(CYAN + "║  [4] 👨‍⚕️ Cadastrar médico                    ║" + RESET);
    System.out.println(CYAN + "║  [6] 🧾 Área do Interessado                 ║" + RESET);
    System.out.println(RED  + "║  [7] ❌ Sair                                ║" + RESET);

		System.out.println(BLUE + "╠════════════════════════════════════════════╣" + RESET);
		System.out.print(YELLOW + "║ 🔹 Escolha uma opção: " + RESET);
		String opcaoNumero = scanner.nextLine().trim();
		System.out.println(BLUE + "╚════════════════════════════════════════════╝" + RESET);

				switch (opcaoNumero) {
				case "1":
					Paciente p = FormularioPaciente.cadastrarPaciente(scanner);
					pacientes.add(p);
					System.out.println(GREEN + "✅ Cadastro de paciente selecionado!" + RESET);
					break;

				case "2":
					Paciente exemplo = FormularioPaciente.criarPacienteExemplo();
					pacientes.add(exemplo);
					System.out.println(GREEN + "✅ Cadastro de paciente selecionado!" + RESET);
					break;

				case "3":
					if (pacientes.isEmpty()) {
						System.out.println(YELLOW + "Nenhum paciente cadastrado." + RESET);
					} else {
						System.out.println(GREEN + "\n✅ Listando pacientes..." + RESET);
						for (int i = 0; i < pacientes.size(); i++) {
							System.out.println("\n--- Paciente " + (i + 1) + " ---");
							pacientes.get(i).exibirInfo();
						}
					}
					break;

				case "4":
					System.out.println(GREEN + "\n✅ Cadastro de médico selecionado!" + RESET);
					FormularioMedico.cadastrarMedico();
					break;
                case "6": 
                        System.out.println(RED + "\n TESTANDO SISTEMA DE INTERRESSADO" + RESET);
                        exibirInterfaceInteressado();
                        break;
				case "7":
					System.out.println(RED + "\n🚪 Saindo do sistema... Obrigado!" + RESET);
					loopMenu = false;
					break;
				
				case "8": 


				default:
					System.out.println(YELLOW + "\n⚠ Opção inválida! Tente novamente." + RESET);
			}
		}

		System.out.println("Encerrando aplicação. Até mais!");
	}

	private static void exibirInterfaceInteressado() {
		interfaceInterresado telaInteressado = new interfaceInterresado();
		telaInteressado.exibirMenu();
	}

	private static void exibirInterfaceConsulta() {
		InterfaceConsulta telaConsulta = new InterfaceConsulta();
		telaConsulta.exibirMenuConsulta();
	}

	 private static void printBarra(int grupos, int total) {
    StringBuilder barra = new StringBuilder();
    int porcentagem = (grupos * 100) / total;

    for (int j = 0; j < grupos; j++) {
        barra.append(" ■ ");
    }

    System.out.print("\r" + barra + " " + porcentagem + "%");
}
}

